dishaa-app/app/controllers/assessment_controller.rb

  def edit
    @students = Student.all
---
SELECT "students".* FROM "students"

  def edit_marks
    @student = Student.find(params[:student_id])
    @grade_subjects = @teacher.grade_subjects
    @subject_ids = @grade_subjects.map { |gs| gs.subject_id }
    @subjects = Subject.select { |s| @subject_ids.include? s.id }
    @exam_types = ExamType.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "grade_subjects".* FROM "grade_subjects" WHERE "grade_subjects"."teacher_id" = ?  [["teacher_id", 1]]
SELECT "subjects".* FROM "subjects"
SELECT "exam_types".* FROM "exam_types"

  def update_marks
    @student = Student.find(params[:student_id])
    subject_id = params[:marks][:subject_id].to_i
    date = params[:marks][:date].to_date
    exam_type_id = params[:marks][:exam_type_id].to_i
    marks_achieved = params[:marks][:marks_achieved].to_f
    max_marks = params[:marks][:max_marks].to_f

    record = Mark.find_by student_id: @student.id, subject_id: subject_id, date: date, exam_type_id: exam_type_id
    record ? record.update(marks_achieved: marks_achieved, max_marks: max_marks) : Mark.create(
      student_id: @student.id, subject_id: subject_id, date: date, exam_type_id: exam_type_id, marks_achieved: marks_achieved,
      max_marks: max_marks)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "marks".* FROM "marks" WHERE "marks"."student_id" = ? AND "marks"."subject_id" = ? AND "marks"."date" IS NULL AND "marks"."exam_type_id" = ? LIMIT ?  [["student_id", 1], ["subject_id", 1], ["exam_type_id", 1], ["LIMIT", 1]]
INSERT INTO "marks" ("student_id", "subject_id", "exam_type_id", "marks_achieved", "max_marks", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["student_id", 1], ["subject_id", 1], ["exam_type_id", 1], ["marks_achieved", 0.0], ["max_marks", 0.0], ["created_at", "2017-07-14 09:18:44.666388"], ["updated_at", "2017-07-14 09:18:44.666388"]]
UPDATE "marks" SET "marks_achieved" = ?, "max_marks" = ?, "updated_at" = ? WHERE "marks"."id" = ?  [["marks_achieved", 65.0], ["max_marks", 100.0], ["updated_at", "2017-07-13 17:01:59.191959"], ["id", 3]]

  def edit_eca
    @student = Student.find(params[:student_id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update_eca
    @student = Student.find(params[:student_id])
    record = params[:eca_record]
    text = record[:text]
    doc_desc = record[:doc_desc]
    uploaded_io = record[:doc_file]
    if uploaded_io
      student_dir = Rails.root.join('private', 'uploaded_docs', 'student_eca',
        "#{@student.first_name + (@student.last_name ? '_' + @student.last_name : '')}")
      FileUtils.mkdir(student_dir) unless Dir.exists? student_dir
      doc_link = student_dir + uploaded_io.original_filename
      File.open(doc_link, 'wb') do |file|
        file.write(uploaded_io.read)
      end
    end

    EcaRecord.create(student_id: @student.id, eca_record: text, doc_link: (doc_link || ''),
      doc_desc: doc_desc, teacher_id: @teacher.id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "eca_records" ("student_id", "eca_record", "doc_link", "doc_desc", "created_at", "updated_at", "teacher_id") VALUES (?, ?, ?, ?, ?, ?, ?)