dishaa-app/app/controllers/attendance_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "grade_subjects"."grade_id" FROM "grade_subjects" WHERE "grade_subjects"."teacher_id" = ? ORDER BY "grade_subjects"."id" ASC LIMIT ?  [["teacher_id", 1], ["LIMIT", 1]]
SELECT "grades".* FROM "grades"
SELECT "subjects".* FROM "subjects"
SELECT "students".* FROM "students"
---
  def edit
    @teacher = Teacher.find(params[:teacher_id])
    @grade_subjects = @teacher.grade_subjects
    @grade_ids = @grade_subjects.map { |gs| gs.grade_id }
    @grades = Grade.select { |g| @grade_ids.include? g.id }
    @subject_ids = @grade_subjects.map { |gs| gs.subject_id }
    @subjects = Subject.select { |s| @subject_ids.include? s.id }
    @students = Student.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."student_id" = ? AND "attendances"."subject_id" = ? AND "attendances"."date" = ? LIMIT ?  [["student_id", 1], ["subject_id", 1], ["date", "2017-07-06"], ["LIMIT", 1]]
INSERT INTO "attendances" ("student_id", "grade_id", "subject_id", "date", "present", "absent", "on_leave", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "attendances" SET "present" = ?, "absent" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["present", "f"], ["absent", "t"], ["updated_at", "2017-07-12 11:07:48.587659"], ["id", 1]]
---
  def update
    @teacher = Teacher.find(params[:teacher_id])
    grade_id = params[:attendance][:grade_id].to_i
    subject_id = params[:attendance][:subject_id].to_i
    date = params[:attendance][:date].to_date
    @students = Student.all # Need to figure out a way of only selecting students

    @students.each do |s|
      student_id = s.id
      record = Attendance.find_by student_id: student_id, subject_id: subject_id, date: date
      case params[:attendance][student_id.to_s]
      when "present"
        record ? record.update(present: true, absent: false, on_leave: false) : Attendance.create(
          student_id: student_id, grade_id: grade_id, subject_id: subject_id, date: date,
          present: true, absent: false, on_leave: false)