dishaa-app/app/controllers/meetings_controller.rb

  def new
    @teacher = Teacher.find(params[:teacher_id])
    Meeting.create(date: Date.tomorrow, time: "", venue: "", agenda: "")
    query = %q(
              SELECT id
              FROM meetings
              WHERE date > DATE('now'))
    meeting_ids = execute_sql(query)
    meeting_ids = meeting_ids.map { |m| m["id"] }
    @meetings = Meeting.find(meeting_ids)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "meetings" ("date", "time", "venue", "agenda", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2017-07-27"], ["time", ""], ["venue", ""], ["agenda", ""], ["created_at", "2017-07-26 17:01:20.086703"], ["updated_at", "2017-07-26 17:01:20.086703"]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @teacher = Teacher.find(params[:teacher_id])

    params[:meetings].each do |id, m|
      id = id.to_i
      date = m["date"].to_date
      time = m["time"]
      venue = m["venue"]
      agenda = m["agenda"]
      meeting = Meeting.find(id)
      meeting.update(date: date, time: time, venue: venue, agenda: agenda)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "meetings" SET "venue" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["venue", "Haldiram's"], ["updated_at", "2017-07-26 17:48:56.984034"], ["id", 7]]

  def delete
    @teacher = Teacher.find(params[:teacher_id])
    id = params[:meeting_id]
    Meeting.delete(id)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 4]]