dishaa-app/app/controllers/mentors_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
  def show
    @teacher = Teacher.find(params[:teacher_id])