dishaa-app/app/controllers/sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email_id" = ? LIMIT ?  [["email_id", "ajain@gmail.com"], ["LIMIT", 1]]
---
  def create
    teacher = Teacher.find_by(email_id: params[:session][:email].downcase)