dishaa-app/app/controllers/student_data_controller.rb

  def show
    @teacher = Teacher.find(params[:teacher_id])
    @students = Student.all
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
SELECT "students".* FROM "students"